course-project-callende-filorca-1-2-master/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE (title LIKE '%rec%')
---
  def index
    @posts = Post.all